{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"bias_constraint": null, "activation": "linear", "data_format": "channels_last", "kernel_regularizer": null, "filters": 32, "name": "conv2d_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dtype": "float32", "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "activity_regularizer": null, "kernel_constraint": null, "batch_input_shape": [null, 64, 64, 3], "strides": [1, 1], "use_bias": true}}, {"class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "filters": 32, "name": "conv2d_6", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "activation": "linear", "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same"}}, {"class_name": "Activation", "config": {"name": "activation_8", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_3", "trainable": true, "padding": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "rate": 0.25, "seed": null, "trainable": true, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "filters": 64, "name": "conv2d_7", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "activation": "linear", "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same"}}, {"class_name": "Activation", "config": {"name": "activation_9", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "filters": 64, "name": "conv2d_8", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "activation": "linear", "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "same"}}, {"class_name": "Activation", "config": {"name": "activation_10", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_4", "trainable": true, "padding": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "rate": 0.25, "seed": null, "trainable": true, "noise_shape": null}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_regularizer": null, "name": "dense_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "units": 512}}, {"class_name": "Activation", "config": {"name": "activation_11", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "rate": 0.5, "seed": null, "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_regularizer": null, "name": "dense_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "units": 5}}, {"class_name": "Activation", "config": {"name": "activation_12", "activation": "softmax", "trainable": true}}], "keras_version": "2.2.2"}